Dataset: <a href="http://www.sidc.be/silso/infossntotdaily">SunSpot Dataset</a>

In [1]:
import pandas as pd

In [4]:
df1 = pd.read_csv('data/ISSN_D_tot.csv')

In [5]:
df1.head()

   1818  01  01.1  1818.004   -1  1
0  1818   1     2  1818.007   -1  1
1  1818   1     3  1818.010   -1  1
2  1818   1     4  1818.012   -1  1
3  1818   1     5  1818.015   -1  1
4  1818   1     6  1818.018   -1  1

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72103 entries, 0 to 72102
Data columns (total 6 columns):
1818        72103 non-null int64
01          72103 non-null int64
01.1        72103 non-null int64
1818.004    72103 non-null float64
 -1         72103 non-null int64
1           72103 non-null int64
dtypes: float64(1), int64(5)
memory usage: 3.3 MB

In [8]:
# The right way

In [7]:
df2 = pd.read_csv('data/ISSN_D_tot.csv', header=None, index_col=0)

df2.head()

      1  2         3  4  5
0
1818  1  1  1818.004 -1  1
1818  1  2  1818.007 -1  1
1818  1  3  1818.010 -1  1
1818  1  4  1818.012 -1  1
1818  1  5  1818.015 -1  1

In [9]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72103 entries, 0 to 72102
Data columns (total 6 columns):
1818        72103 non-null int64
01          72103 non-null int64
01.1        72103 non-null int64
1818.004    72103 non-null float64
 -1         72103 non-null int64
1           72103 non-null int64
dtypes: float64(1), int64(5)
memory usage: 3.3 MB

In [10]:
# The better way

In [11]:
col_names = ['year', 'month', 'day', 'dec_date', 'sunspots', 'definite']
df3 = pd.read_csv('data/ISSN_D_tot.csv', header=None, names=col_names, na_values={'sunspots': ' -1'})
df3.head()

   year  month  day  dec_date  sunspots  definite
0  1818      1    1  1818.004       NaN         1
1  1818      1    2  1818.007       NaN         1
2  1818      1    3  1818.010       NaN         1
3  1818      1    4  1818.012       NaN         1
4  1818      1    5  1818.015       NaN         1

In [12]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72104 entries, 0 to 72103
Data columns (total 6 columns):
year        72104 non-null int64
month       72104 non-null int64
day         72104 non-null int64
dec_date    72104 non-null float64
sunspots    68857 non-null float64
definite    72104 non-null int64
dtypes: float64(2), int64(4)
memory usage: 3.3 MB

In [13]:
df4 = pd.read_csv('data/ISSN_D_tot.csv', header=None, names=col_names, na_values={'sunspots': ' -1'}, parse_dates=[[0, 1, 2]])
df4.head()

  year_month_day  dec_date  sunspots  definite
0     1818-01-01  1818.004       NaN         1
1     1818-01-02  1818.007       NaN         1
2     1818-01-03  1818.010       NaN         1
3     1818-01-04  1818.012       NaN         1
4     1818-01-05  1818.015       NaN         1

In [14]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72104 entries, 0 to 72103
Data columns (total 4 columns):
year_month_day    72104 non-null datetime64[ns]
dec_date          72104 non-null float64
sunspots          68857 non-null float64
definite          72104 non-null int64
dtypes: datetime64[ns](1), float64(2), int64(1)
memory usage: 2.2 MB